'''константы для конвертера величин'''

'''все единицы приводятся к базовой единице измерения'''
'''длина: базовая единица — метр'''
LENGTH_UNITS = {'mm': 0.001, 'cm': 0.01, 'm': 1, 'km': 1000}

'''масса: базовая единица — килограмм'''
MASS_UNITS = {'g': 0.001, 'kg': 1}

'''температура обрабатывается отдельно, так как для неё используются формулы, а не только коэффициенты'''
TEMPERATURE_UNITS = {'c': 'celsius', 'f': 'fahrenheit', 'k': 'kelvin'}

'''все доступные единицы конвертера'''
AVAILABLE_UNITS = {**LENGTH_UNITS, **MASS_UNITS, **TEMPERATURE_UNITS}
'''максимльная вложенность скобок калькулятора'''
MAX_BRACKET_DEPTH = 900
